# IsInPlace Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..IsInPlace Property
Family Class See Also
---
True if the family is an in-place family, false if the family is a loadable family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInPlace { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInPlace As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInPlace {
	bool get ();
}
```

# See Also
Family Class
Autodesk.Revit.DB Namespace